OpenFOAM/cavityTurb/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM 2.4.0                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
    LESModel        WALE;          // or Smagorinsky, oneEqEddy, kEqn, dynSmagorinsky
    turbulence      on;
    printCoeffs     on;

    delta           cubeRootVol;   // grid filter
    cubeRootVolCoeffs
    {
        deltaCoeff  1;             // 0.8–1.2 typical
    }

    // Optional (defaults usually fine):
    // WALECoeffs { Cw 0.325; }     // only if you want to override
}

// ************************************************************************* //


// ************************************************************************* //
